[System.Serializable]
public class LocalData_RUS {
  public string local = "RUS";
  public string main_Load = "Загрузка ...";
  public string main_GameName = "Космическая прогулка";
  public string main_ButtonStart = "Играть сначала";
  public string main_ButtonContinue = "Продолжить сохранённую";
  public string main_UserID = "Ваш id: ";

  public string main_PlDatStr_GamP = "Игровой прогресс: ";
  public string main_PlDatStr_Crys = "Кристаллы: ";
  public string main_PlDatStr_MaOx = "Максимальный запас кислорода: ";
  public string main_PlDatStr_Tech = "Тех-контейнеры: ";
  public string main_PlDatStr_CurT = "Текущее задание: ";
  public string main_PlDatStr_WeRT = "Время перезарядки оружия: ";
  public string main_PlDatStr_PSpe = "Скорость игрока: ";
  public string main_PlDatStr_Phea = "Здоровье игрока: ";
  public string main_PlDatStr_MaFu = "Максимальный запас топлива: ";
  public string main_PlDatStr_PrFi = "Версия защитного поля: ";

  public string MissionDialog_00 = "\tЖесткая посадка, нужно выяснить, что привело к крушению. Но сейчас другая проблема, заканчивается кислород. <b><color=red>Нужно срочно добежать до базы</color></b>, там кислород пополняется. \n\tДля передвижения используй клавиши AWSD, для поворота и прыжка стрелки, или сенсорную клавиатуру.";
  public string MissionDialog_01 = "\tЗапас кислорода слишком мал. На этой базе можно его увеличить. Если собирать кристаллы и приносить их на базу, можно улучшать запас. <b><color=red>Нужно собрать 10 кристаллов</color></b>, их много рядом, принести на базу <b><color=red>и купить улучшение.</color></b> \n\tКристаллы мало собрать, их нужно донести до базы. На месте собранного кристалла, со временем появится новый.";
  public string MissionDialog_02 = "\tВокруг есть кристаллы, но их слишком мало для рейдов вглубь планеты. Тут есть множество кратеров, в них должно быть гораздо больше кристаллов. <b><color=red>Найди базу изучения кристаллов. </color></b>Она рядом с кратером, и отмечена на радаре. В кратере много кристаллов. \n\tНужно подойти к радару, тогда появится сферическая голограмма карты. На ней есть  маркер твоего положения и ориентации, красная стрелка. Ещё красным пунктирным кружком отмечено местоположение текущей цели. Голограммой можно управлять с помощью оранжевых сенсорных кнопок.";
  public string MissionDialog_03 = "\tПодозрительно много охраны. Нужно выяснить, что тут происходит. Но в начале нужно улучшить оружие, иначе не справится. Тут должна быть <b><color=red>«База вооружения», найди её</color></b>, думаю, на ней можно улучшить оружие. \n\tПопробуй двойной прыжок. Так, если подпрыгнуть, повторное нажатие на стрелку включит реактивный ранец, и подбросит вверх. Или можно подскочить вперёд, если нажать во время прыжка стрелку вниз. На это расходуется топливо.";
  public string MissionDialog_04 = "\tСтановится всё больше боевых машин. Нужно скорее улетать с этой планеты. При аварийной посадке, я заметил <b><color=red>космодром.</color></b> Он был недалеко от радиолокационных тарелок. Надеюсь, там найдётся какой-нибудь транспорт. \n\tЭти турели не очень поворотливы, но после уничтожения, какая-то ремонтная система их снова восстанавливает. Что тут происходит?";
  public string MissionDialog_05 = "\tПохоже, так просто не улететь. Этими комплексами кто-то или что-то управляет. Что бы выяснить, придётся разведать что дальше. Мне нужно улучшить топливные баки реактивного ранца. <b><color=red>Нужно найти станцию «Реактивных двигателей»,</color></b> там, я смогу улучшить снаряжение. \n\tТех-контейнеры, остающиеся после взорванных турелей тоже нужно сперва отнести на главную базу, что бы потом покупать улучшения.";
  public string MissionDialog_06 = "\tПохоже, комплекс управляется неисправной «Системой безопасности». Нужно скорее улетать. Но для Шаттла нужно топливо. <b><color=red>На «Топливной станции» нужно получить ключ доступа.</color></b> Ключ доступа нужно донести до шаттла.\n\tИщи топливные баки, там можно заправить реактивный ранец.";
  public string MissionDialog_07 = "\tЭто уже не смешно, слишком опасно. Нужно улучшить свою броню, иначе эти турели и роботы меня уничтожат. Мой скафандр оснащён защитным полем. Если я <b><color=red>найду «Кибернетическую лабораторию»</color></b>, я смогу улучшить его. \n\tЗащитное поле тратится, когда в него попадают выстрелы, и так защищает меня. Поле само медленно восстанавливается, но только если выйти из боя.";
  public string MissionDialog_08 = "\tДля шаттла нужна энергия. <b><color=red>Ключ доступа должен быть на «Электростанции»</color></b>. Нужно найти её. Ключ доступа нужно донести до шаттла. \n\tНельзя просто так улететь, пострадает ещё кто-то. Нужно найти способ остановить безумную систему.";
  public string MissionDialog_09 = "\tНа электростанции я выяснил, в южной части планеты расположен боевой комплекс, он и сбил мой корабль. Его нужно отключить. Комплекс питают <b><color=red>3 реактора, нужно уничтожить их все</color></b>.\n\tНа карте отмечены три точки, где расположены реакторы. Там полно охраны!";
  public string MissionDialog_10 = "\tВсе три реактора уничтожены, и защита комплекса ослабла. Осталось <b><color=red>найти ключ доступа «Охранной системы» и добежать до шаттла</color></b>.\n\tСтранно, что никто не управляет станциями, что привело их в боевой режим, и почему они нападают? Нет времени думать, нужно хватать ключ и улетать.";
  public string MissionDialog_11 = "\tПохоже, кто-то специально запрограммировал модули охраны на нападение. Кто и зачем? В следующий раз разберусь с этим. \n\t<b><color=red>Победа!</color></b>";

  public string button_CurrentTask = "Текущее задание";
  public string button_Shop = "Магазин";
  public string button_Menu = "Меню";
  public string NewTask = "Новое задание:";

  public string fps = "Кадров в секунду: ";

  public string PlayMenu_Pause = "ПАУЗА";
  public string PlayMenu_GraphicsQuality = "Качество графики:";
  public string PlayMenu_BUTT_QualityLow = "Низкое";
  public string PlayMenu_BUTT_QualityNormal = "Нормальное";
  public string PlayMenu_BUTT_QualityHi = "Высокое";
  public string PlayMenu_BUTT_MainMenu = "Главное меню";
  public string PlayMenu_BUTT_Close = "Закрыть";  
  
  public string Store_RechargeTime = "Время перезарядки: ";
  public string Store_Sec = " сек";
  public string Store_CurrentFieldLevel = "Текущий уровень поля: ";
  public string Store_Maximum4 = " (максимальный: 4)";  
  public string Store_WeaponUpgrade = "Улучшение оружия";
  public string Store_FieldUpgrade = "Улучшение защитного поля";
  public string Store_BUTT_Buy = "Купить";

  public string Radar_BUTT_Goal = "Где цель?";
  public string Radar_BUTT_Rotation = "Вращение карты";
  public string Radar_BUTT_Tilt = "Наклон карты";
  public string Radar_BUTT_WhereIAm = "Где я?";
  public string Radar_CurrentGoal = "Текущая цель: ";

  public string Restart = "Рестарт";
  public string GameOver = "Проигрыш";
  public string Victory = "Победа!";
}

